# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = input ("Введите любую строку ")

print (text.count (","))

if text.count (",") == text.count ("."):
    print("Запятых и точек одинаково")
elif text.count (",") > text.count ("."):
    print ("Запятых больше")
else:
    print("Точек больше")
